{"id":1024,"date":"2021-09-17T14:20:42","date_gmt":"2021-09-17T13:20:42","guid":{"rendered":"https:\/\/moneyinminutes.ng\/?p=1024"},"modified":"2021-09-20T15:02:03","modified_gmt":"2021-09-20T14:02:03","slug":"repay-debts-loans","status":"publish","type":"post","link":"https:\/\/moneyinminutes.ng\/repay-debts-loans\/","title":{"rendered":"What Happens if You Don&#8217;t Repay Your Debts and Loans?"},"content":{"rendered":"\n<p>When you don&#8217;t repay your debts and loans, there are bound to be consequences, which will depend largely on the type of debt or loan involved as well as precisely how much you owe.<\/p>\n\n\n\n<p>If you have unpaid debts and loans and you find yourself feeling stressed out, it&#8217;s important to remember that this will not make the debt or loan go away. What this means is that you still need to repay the debt or loan.<\/p>\n\n\n\n<p>The question then becomes, how panicked should you be? The answer to this still rests on the type of loan involved as well as what you intend to do about it.<\/p>\n\n\n\n<p>Below are some of the things that could happen to you if you don&#8217;t repay your debts and loans:<\/p>\n\n\n\n<ul><li>You will be placed on a Watch List<\/li><li>Your credit score will be affected<\/li><li>Legal action will be taken against you<\/li><li>The unpaid debt or loan will haunt you for years<\/li><li>Your debt will go to a collection agency<\/li><li>Debt collectors will eventually come after you<\/li><\/ul>\n\n\n\n<p>Now, we will examine each of these possible outcomes while talking you through what you need to do if you ever find yourself with an unpaid debt or a stretched due date<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-1-1024x355.jpg\" alt=\"\" class=\"wp-image-1028\" width=\"642\" height=\"222\" srcset=\"https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-1-1024x355.jpg 1024w, https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-1-300x104.jpg 300w, https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-1-768x267.jpg 768w, https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-1.jpg 1135w\" sizes=\"(max-width: 642px) 100vw, 642px\" \/><\/figure><\/div>\n\n\n\n<p style=\"font-size:30px\"><strong>You Get Placed on a Watch List<\/strong><\/p>\n\n\n\n<p>A watch list is a list of people that have been identified and labelled as having a high tendency to take loans without repaying. As expected, being placed on such a list comes with dire consequences. You are placed on a watch list if you fail to make repayment on your loan and eventually get reported to the Central Bank of Nigeria by credit referencing agencies in Nigeria.<\/p>\n\n\n\n<p>For instance, when you are placed on a watch list over an unpaid debt or loan, what this translates into is that you will be officially listed as not being creditworthy. In other words, this means that you become officially labelled as someone who cannot be trusted with a loan facility as your history shows you are highly likely not to repay or default in your repayment.<\/p>\n\n\n\n<p>This means that no matter how badly you need money for an emergency or urgent need of any kind, your loan application will be rejected as you have been labelled. However, it does not end there as you could eventually end up with a lawsuit.<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>Your Credit Score Will be Affected<\/strong><\/p>\n\n\n\n<p>The moment you are placed on a watch list, one of the first things that will suffer is your credit score. A credit score is a number that represents your creditworthiness and they are based on a variety of personal financial data.<\/p>\n\n\n\n<p>In case you didn&#8217;t know, financial institutions judge individuals with higher credit scores to have lower credit risk. Individuals in this category are granted a broader selection of credit products at lower interest rates. In other words, financial institutions and consumer finance companies will be willing to lend you money.<\/p>\n\n\n\n<p>However, when you have unpaid debts and loans, the implication is the direct opposite of having a good credit score. A poor credit score raises a red flag and sticks with you like a badge of notoriety. A bad credit score typically ranges between 300 and 579. A poor credit score makes it harder for you to borrow money regardless of whether it&#8217;s a car loan, mortgage or personal loan.<\/p>\n\n\n\n<p>In cases where you somehow qualify for the loan, you are likely to be stuck with a higher interest rate as you would be considered high risk.<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>You Find Yourself With a Court Case on Your Hands<\/strong><\/p>\n\n\n\n<p>When you default on your loan repayment, you can be charged to court and you can eventually end up paying far more than you bargained for. Having a court case hanging over your head can be very disruptive to your personal life and comes with a truckload of stress.<\/p>\n\n\n\n<p>According to Tech Cabal, a digital media company, “The Nigerian attitude to debt is curious and nowhere could this have been better demonstrated than in the Federal government’s failure to recover thousands of loans disbursed to farmers under the Anchor Borrowers Scheme.”<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>You Risk Getting Blacklisted by Other Companies<\/strong><\/p>\n\n\n\n<p>As you already know, the world has become a global village where data around your credit history is accessible to financial institutions and lenders generally.<\/p>\n\n\n\n<p>The CRC Credit Bureau Limited, a private limited liability company duly incorporated and licensed under the laws of the Federal Republic of Nigeria was established by a consortium of Ten (10) leading financial institutions and Dun &amp; Bradstreet and provides a nationwide information repository on credit profiles of corporate entities as well as consumers, thus improving the ability of credit providers to make informed lending decisions.<\/p>\n\n\n\n<p>This database enables banks and lenders to effectively assess your credit risk. What this simply means is that if you take a loan and fail to repay, you risk getting blacklisted by the credit bureau, which means you will end up getting blacklisted by other financial organisations as well.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"355\" src=\"https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-2-1024x355.jpg\" alt=\"Repay-Debts-Loans\" class=\"wp-image-1027\" srcset=\"https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-2-1024x355.jpg 1024w, https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-2-300x104.jpg 300w, https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-2-768x267.jpg 768w, https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-2.jpg 1135w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p style=\"font-size:30px\"><strong>Your Unpaid Debt or Loan Will Haunt You For Years<\/strong><\/p>\n\n\n\n<p>You can&#8217;t simply wish an unpaid loan away. It integrates itself into your credit record and by extension, your credit score. If you do not seek corrective measures like taking personal loans on a trusted platform like Money in Minutes, it will always rear its ugly head given that it is linked to your BVN.<\/p>\n\n\n\n<p>You would agree that there&#8217;s a huge difference between a ₦70,000 and a ₦7 million loan. While you might try to wriggle your way out of a ₦70,000 loan, things might become quite complicated for you with the latter.&nbsp;<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>Your Debt Goes to a Collection Agency<\/strong><\/p>\n\n\n\n<p>As the name implies, loan collection agencies are tasked with the responsibility of recovering unpaid debts and loans from defaulters. There are quite a number of them in Nigeria and some of the strategies they adopt could leave your reputation in tatters long after you have been made to repay.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-3-1024x355.jpg\" alt=\"\" class=\"wp-image-1029\" width=\"589\" height=\"204\" srcset=\"https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-3-1024x355.jpg 1024w, https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-3-300x104.jpg 300w, https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-3-768x267.jpg 768w, https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/What-Happens-if-You-Dont-Repay-a-Loan-3.jpg 1135w\" sizes=\"(max-width: 589px) 100vw, 589px\" \/><\/figure><\/div>\n\n\n\n<p style=\"font-size:30px\"><strong>Debt Collectors Will Eventually Come After You<\/strong><\/p>\n\n\n\n<p>For some lenders, recovering an unpaid loan might prove to be a daunting task but debt collectors have mastered the art of applying pressure and go all out in their quest to recover unpaid debts and loans.<\/p>\n\n\n\n<p>Below is a debt recovery process we pulled up from one of such debt collectors:<\/p>\n\n\n\n<ul><li>Client Agreement<\/li><li>Orchestrated negotiation first<\/li><li>Initial Investigation\/Background check on the Debtor<\/li><li>Telephone contact and Follow up over telephone calls and emails<\/li><li>Issuance of In-house Demand<\/li><li>Ultimatum Notice<\/li><li>Physical visit if required (wherever possible)<\/li><li>Rigorous Follow up with the debtor<\/li><\/ul>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"770\" height=\"290\" src=\"https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/Debt-collection-process.jpg\" alt=\"\" class=\"wp-image-1031\" srcset=\"https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/Debt-collection-process.jpg 770w, https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/Debt-collection-process-300x113.jpg 300w, https:\/\/moneyinminutes.ng\/wp-content\/uploads\/2021\/09\/Debt-collection-process-768x289.jpg 768w\" sizes=\"(max-width: 770px) 100vw, 770px\" \/><\/figure>\n\n\n\n<p>It is not unusual to find debt collectors offering to recover unpaid loans on a &#8221; 100% no recovery &#8211; no fees basis&#8221; adding that collection efforts are on a pre-legal basis.<\/p>\n\n\n\n<p>At some point, your phone will begin to ring a lot followed by demand letters that will be sent to you in a calculated bid to recover your unpaid loan.<\/p>\n\n\n\n<p>At the end of this phase, one of two things will happen &#8211; you will either be able to pay your debt or negotiate to a point where your debt problems would disappear rather quickly.<\/p>\n\n\n\n<p>However, if you still fail to repay, you might find your stress levels rising with the phase that follows.<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>Final Thoughts on What Happens If You Don’t Repay Debts and Loans<\/strong><\/p>\n\n\n\n<p>Regardless of how much you owe a financial institution or consumer finance organisation, one thing that will not happen is that you cannot be jailed for not repaying a loan.<\/p>\n\n\n\n<p>However, we should add here that there are worse things than getting jailed. For instance, an unpaid loan could bring your financial reputation to ruins and hurt your credit record.<\/p>\n\n\n\n<p>Before things get out of hand with your loan repayment, it is always best to respect your contractual agreement with the lender. When you take a loan, endeavour to make your monthly repayments. In cases where you suspect you might miss a repayment deadline, you must inform the lender and reach an agreement on when you will make the anticipated missed payment.<\/p>\n\n\n\n<p>If you have had a rough start to your credit history, we can help you recover from this by helping you build your credit score. Simply apply for a loan and make repayments based on agreed dates and timelines but build yourself a formidable credit score. Take the first step by <a href=\"https:\/\/myaccount.moneyinminutes.ng\/Account\/Register\"><strong>installing the Money in Minutes app<\/strong><\/a>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When you don&#8217;t repay your debts and loans, there are bound to be consequences, which &hellip; <a href=\"https:\/\/moneyinminutes.ng\/repay-debts-loans\/\">Continued<\/a><\/p>\n","protected":false},"author":3,"featured_media":1026,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none"},"categories":[1],"tags":[17,15],"_links":{"self":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1024"}],"collection":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/comments?post=1024"}],"version-history":[{"count":2,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1024\/revisions"}],"predecessor-version":[{"id":1033,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1024\/revisions\/1033"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media\/1026"}],"wp:attachment":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media?parent=1024"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/categories?post=1024"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/tags?post=1024"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}