{"id":1149,"date":"2022-02-04T10:19:13","date_gmt":"2022-02-04T09:19:13","guid":{"rendered":"https:\/\/moneyinminutes.ng\/?p=1149"},"modified":"2022-02-04T10:19:14","modified_gmt":"2022-02-04T09:19:14","slug":"tricks-to-reduce-your-electricity-bill-in-nigeria","status":"publish","type":"post","link":"https:\/\/moneyinminutes.ng\/tricks-to-reduce-your-electricity-bill-in-nigeria\/","title":{"rendered":"Tricks to Reduce Your Electricity Bill in Nigeria"},"content":{"rendered":"\n<p id=\"b41b\">The recent yet frequent hike in electricity tariff in Nigeria hasn’t gone unnoticed and it is smart to look into legitimate ways to cut down your usage in a bid to reduce your monthly electricity bill in line with our ‘Smart Money Moves’ series.<\/p>\n\n\n\n<p id=\"06ee\">In case you haven’t already started looking for ways to spend less of your money on electricity bills, it is something you really need to put some effort into achieving, especially if you have and use a prepaid meter.<\/p>\n\n\n\n<p id=\"d656\">If you do not have a prepaid meter, you might still unavoidably find yourself at the mercy of the electricity distributors and their estimated monthly bills, which you know you have little or no control over.<\/p>\n\n\n\n<p id=\"2f38\">As we mentioned earlier, if you, however, have a prepaid meter installed in your home, you have an added advantage over those who do not. However, there are still tips that can help you spend less of your hard earned salary on electricity as you will find out in the lines below:<\/p>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"8397\"><strong>Use Only Energy-Efficient Bulbs<\/strong><\/h1>\n\n\n\n<p id=\"44b9\">The irony of non-energy-efficient bulbs is that they are cheaper than energy-efficient bulbs. However, what you will find more interesting is the fact that they become more expensive to use in the long run and the reason is simple. Non-energy-efficient bulbs consume more power than energy saving bulbs.<\/p>\n\n\n\n<p id=\"e0ed\">Let’s break this down — On an average, the typical regular bulb uses between 60–200 watts while energy-saving bulbs use between 7–11 watts. As you can see, the difference in their electricity consumption is crystal clear. Non-energy saving bulbs consume more than 10 times the power than energy-saving bulbs consume.<\/p>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"5181\"><strong>Be Deliberate About Switching Off the Lights<\/strong><\/h1>\n\n\n\n<p id=\"8018\">Are you one of those people who act under the assumption that bulbs don’t consume too much energy and turning them on and off wouldn’t make much of a difference? If you are, then you are in error because bulbs do consume energy but the amount they consume depends on two things — how long you leave them on for the types of bulbs that you use.<\/p>\n\n\n\n<p id=\"262f\">As we have pointed out earlier, incandescent bulbs, which are quite popular in Nigeria are not energy-saving bulbs and are more expensive to use because of the sheer amount of energy they consume.<\/p>\n\n\n\n<p id=\"43ac\">What this means for you as a user is that you need to be more conscious about turning off the bulbs in your home when they are not in use, especially during the day and when you are going to bed. You also need to pay attention to every other room in the house with a bulb and this includes the kitchen, bathroom toilet, store and the bar area if you have one. The only light that you are advised to leave on are the security lights.<\/p>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"6945\"><strong>Cut Off Background Power Consumption<\/strong><\/h1>\n\n\n\n<p id=\"bc18\">Have you ever found yourself turning off a device but leaving it plugged with the mindset that the power supply has been cut off. If you do this, then you have been going about saving power the wrong way.<\/p>\n\n\n\n<p id=\"ab4d\">What you should do instead is to cut off power to the device by turning off both the socket and the device’s power switch. This is important because devices and appliances still consume what is known as ‘residue energy’ (or vampire power) whenever they remain plugged to a power source that has not been switched on.<\/p>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"64d5\"><strong>Limit the Use of Your Fan<\/strong><\/h1>\n\n\n\n<p id=\"1aab\">Studies have shown that the ceiling fan stands out as one of the biggest passive power consumers in your home and this is due to the sheer number of hours for which it stays on. Sadly, many do not know this, which explains why we still find people leaving their fans even when they are leaving their house.<\/p>\n\n\n\n<p id=\"93f1\">Leaving your fan working all day and night has a significant impact on your electricity bills. So, keep an eye on that by regulating their runtime. Another thing you can do is to replace your fans with an energy-saving model if it is something you can afford.<\/p>\n\n\n\n<p id=\"5654\">If this, however, falls outside your budget, simply make do with what you have by being mindful of how long your fan stays running for.<\/p>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"4207\"><strong>Your AC is a Big Deal<\/strong><\/h1>\n\n\n\n<p id=\"6ea8\">For your air conditioner, it’s capacity for high energy consumption is well known and truly for the brave. Leaving it running for extended hours can leave a gaping hole in your pocket and by extension, your recurring bills.<\/p>\n\n\n\n<p id=\"ff60\">Let’s have a closer look at this — If you leave a 1.5hp air conditioner running for 10 hours at a rate of N60 per kilowatt, this would leave you with a bill well over N30,000. This should give you more context into how much it is costing you to use your air conditioner at home.<\/p>\n\n\n\n<p id=\"29c2\">We’ll suggest alternating the use of your AC with your fan rather than continuously using your AC for extended hours. This is also dependent on the units of electricity that you purchase on a monthly basis. If you limit the use of your fan to around 8 hours per day, it could end up saving you hundreds of naira.<\/p>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"6051\"><strong>Don’t Forget Your Refrigerator<\/strong><\/h1>\n\n\n\n<p id=\"8bb9\">Refrigerators have a reputation for consuming energy, especially if you use non-energy-saving brands. Did you know that on an average, a refrigerator consumes as much as 1,200 watts per day. This also depends on the brand and model, which puts it as one of the top energy consumers in your home.<\/p>\n\n\n\n<p id=\"916b\">One way to go about reducing the energy consumption of your refrigerator is by buying a small refrigerator or freezer. If you’re not going for this option, another thing you can do is to move your refrigerator to a part of the house that has adequate air circulation as this helps it become more power efficient<\/p>\n\n\n\n<p id=\"ba42\">Avoid stuffing up your fridge because this cuts down its overall efficiency due to the insufficient space left for adequate air circulation. In essence, the more stuffed up the refrigerator is, the more the power it would need to keep its content refrigerated.<\/p>\n\n\n\n<p id=\"f516\">Finally, keep your refrigerator away from direct sunlight. Also, don’t keep it next to the oven or dishwasher because All of that extra heat will cause it to run more frequently. By extension, this will add to your utility bill, and wear out your fridge sooner than expected.<\/p>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"fcff\"><strong>Final Thoughts on Reducing Your Electricity Bill in Nigeria<\/strong><\/h1>\n\n\n\n<p id=\"44fd\">On a final note, you need to take a slow walk around your home and study it to see where all that electricity that you are paying for is going.<\/p>\n\n\n\n<p id=\"bc6d\">If possible, take out a notepad with you on your walk and list out every single energy-consuming appliance and gadget in your home as well as their watt rating.<\/p>\n\n\n\n<p id=\"6f6c\">From that point, you can begin trimming down your energy consumption by replacing high-energy-consuming devices and appliances with energy-efficient brands and models.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The recent yet frequent hike in electricity tariff in Nigeria hasn’t gone unnoticed and it &hellip; <a href=\"https:\/\/moneyinminutes.ng\/tricks-to-reduce-your-electricity-bill-in-nigeria\/\">Continued<\/a><\/p>\n","protected":false},"author":3,"featured_media":1151,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none"},"categories":[18],"tags":[20,17,19,21],"_links":{"self":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1149"}],"collection":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/comments?post=1149"}],"version-history":[{"count":1,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1149\/revisions"}],"predecessor-version":[{"id":1152,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1149\/revisions\/1152"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media\/1151"}],"wp:attachment":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media?parent=1149"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/categories?post=1149"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/tags?post=1149"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}