{"id":1154,"date":"2022-02-08T11:40:53","date_gmt":"2022-02-08T10:40:53","guid":{"rendered":"https:\/\/moneyinminutes.ng\/?p=1154"},"modified":"2022-02-08T11:40:55","modified_gmt":"2022-02-08T10:40:55","slug":"6-passive-income-ideas-in-nigeria","status":"publish","type":"post","link":"https:\/\/moneyinminutes.ng\/6-passive-income-ideas-in-nigeria\/","title":{"rendered":"6 Passive Income Ideas in Nigeria"},"content":{"rendered":"\n<p id=\"0a8e\">One of the best things about passive income streams is that they allow you to earn additional money whilst allowing you to keep your 9–5 job or run your business as the case may be.<\/p>\n\n\n\n<p id=\"c636\">In other words, passive income allows you to make money while maintaining your primary job or business. Interestingly, if you can successfully build and maintain a steady stream of passive income, you could choose to quit your job and take it up as a full-time venture. The goal is to find a passive income stream that gives you additional financial security.<\/p>\n\n\n\n<p id=\"4a4b\">However, it’s important to ensure that whichever passive income stream you’re considering is one that is legitimate. The last thing you want is to have a passive income stream that constantly has you looking over your shoulders regardless of how much you make from it.<\/p>\n\n\n\n<p id=\"4ea6\">Meanwhile, for you to establish a successful passive income stream, two key ingredients are time and money. The more you have at your disposal and invest in it, the higher your chances of earning even more passive income.<\/p>\n\n\n\n<p id=\"2d0e\">Before we proceed, let us take a quick look at the three major types of income you can generate. They are earned income, passive income and capital gains income.<\/p>\n\n\n\n<h2 id=\"e677\"><strong>Earned Income<\/strong><\/h2>\n\n\n\n<p id=\"bc68\">This is the income you earn from your job through your paycheck regardless of whether it comes in weekly or monthly. It is quite common in Nigeria and is usually pegged at a fixed rate, which you are paid by the company every month.<\/p>\n\n\n\n<h2 id=\"e424\"><strong>Passive Income<\/strong><\/h2>\n\n\n\n<p id=\"a923\">Passive income is money generated from assets that you have invested in or worked on at some point in the past. In other words, you invest your time and money into it and then reap the fruits at a later time with lesser effort than you put into your 9–5 job.<\/p>\n\n\n\n<h2 id=\"246b\"><strong>Capital Gains Income<\/strong><\/h2>\n\n\n\n<p id=\"9129\">Another name for this income is ‘portfolio income. Basically, it is the income you generate from selling an asset at a higher price than you bought it. Some prime examples of ‘capital gains income’ include:<\/p>\n\n\n\n<ul><li>Buying and selling stocks, bonds as well as mutual funds<\/li><li>Buying and selling real estate assets<\/li><li>Buying and selling valuable items or collectibles such as gold<\/li><\/ul>\n\n\n\n<p id=\"0897\">We should add here that passive income is not a get-rich-quick scheme. What you earn is totally up to you and the choices that you make. However, you’d want to get it right as early as you can so that you can begin enjoying your passive income.<\/p>\n\n\n\n<p id=\"2043\">Now that you know the different types of income you can earn for yourself, below are 5 legitimate passive income ideas that can earn you as much as N500,000 monthly.<\/p>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"f8a6\"><strong>Affiliate Marketing<\/strong><\/h1>\n\n\n\n<p id=\"1eef\">This is the practice of promoting the services or products or services of an individual or company in exchange for a commission on each resulting sale.<\/p>\n\n\n\n<p id=\"9790\">Simply put, your job is to direct potential buyers to sellers from whom they can make a purchase. You then earn a commission on each sale the seller records from that interaction..<\/p>\n\n\n\n<p id=\"3742\">What you make as an affiliate marketer depends largely on the terms and conditions guiding the market where you eventually pitch your tent.<\/p>\n\n\n\n<p id=\"45dc\">On a final note, you might also want to take a crash course on affiliate marketing to avoid getting discouraged way too early.<\/p>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"98a0\"><strong>Dropshipping<\/strong><\/h1>\n\n\n\n<p id=\"18a5\">In simple terms, dropshipping refers to a form of retail business where you (as a seller) accept customer orders but don’t keep the goods sold in stock.<\/p>\n\n\n\n<p id=\"f6a7\">In other words, instead of warehousing inventory, you purchase products as a merchant from third-party suppliers as customers make orders. You then proceed to ship the products directly to customers.<\/p>\n\n\n\n<p id=\"a510\">For instance, a wristwatch worth N8,000 is available for sale at a trusted store. You list this same wristwatch on your own store at N20,000 and eventually find a buyer whom you ship it to.<\/p>\n\n\n\n<p id=\"193c\">On that sale alone, you have made N13,000. Please note that dropshipping is 100% legitimate and is widely embraced within the Nigerian online marketplace.<\/p>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"442a\"><strong>POS Business<\/strong><\/h1>\n\n\n\n<p id=\"badf\">This is another passive income generator in Nigeria and it is quite profitable. The smart thing to bear in mind for POS businesses in Nigeria is to ensure you have a physical presence at a location with heavy human traffic, particularly those around popular markets and neighbourhoods.<\/p>\n\n\n\n<p id=\"f47e\">We should mention here that those who operate POS businesses in Nigeria are known as POS agents. As a POS agent, you get money from commissions when you carry out any authorised financial transactions on behalf of a consumer\/customer. On several occasions, people find themselves in dire need of cash and either cannot access an ATM or are put off by long queues and faulty machines.<\/p>\n\n\n\n<p id=\"ba24\">This is where you come in by giving them access to cash in exchange for transfers or via using their debit cards on the POS machine. In Nigeria, it is quite lucrative and can help you generate a steady stream of passive income.<\/p>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"c0c3\"><strong>Agriculture<\/strong><\/h1>\n\n\n\n<p id=\"8a07\">Gone are the days when agriculture involved buying acres of land as a farmer and physically getting down to the business at hand. Today, technology has made life much easier for you by giving you the option of generating passive income from agriculture.<\/p>\n\n\n\n<p id=\"351d\">There are several platforms that allow you to invest in agriculture from any part of the world without necessarily becoming a farmer. Some of the popular platforms where you can invest and generate passive income are:<\/p>\n\n\n\n<ul><li>Farmcrowdy<\/li><li>ThriveAgric<\/li><li>Growsel<\/li><li>Efarms<\/li><li>Agrecourse<\/li><\/ul>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"d38c\"><strong>Social Media Influencing<\/strong><\/h1>\n\n\n\n<p id=\"2a1c\">If you have high engagement on your social media posts as well as at least 1,000 followers, you can set up a structure to help you earn passive income as a social media influencer.<\/p>\n\n\n\n<p id=\"b122\">This basically involves using a social media platform to help clients achieve their marketing goals. Such marketing objectives can cut across brand awareness, lead generation, customer retention and many more.<\/p>\n\n\n\n<p id=\"6670\">Nigeria is replete with social media influencers who have built a reputation with their high engagement and fanbase. If you set this up really well, it could grow to become much more than just a passive income stream. Below is a list of some of the top social media influencers making an impact in Nigeria today.<\/p>\n\n\n\n<ul><li>Uche Eze<\/li><li>Noble Igwe<\/li><li>Mazi Ibe<\/li><li>Linda Ikeji<\/li><li>Ademola Ogundele<\/li><li>Adegoke Pamilerin<\/li><li>Adaobi Okonkwo<\/li><li>Ronke Edoho<\/li><li>Aproko Doctor<\/li><li>Sisi Yemmie<\/li><li>Nma<\/li><li>Volqx<\/li><li>Dimma Umeh<\/li><li>Nosa &amp; Folly<\/li><li>Valking<\/li><li>Chemical Brother<\/li><li>Queen Preshii<\/li><li>Denola Grey<\/li><li>Four Eye Edo boy<\/li><li>Aunty Ada<\/li><li>Alhaji Royz<\/li><\/ul>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"a191\"><strong>Selling Photos Online<\/strong><\/h1>\n\n\n\n<p id=\"32d9\">Selling quality images on platforms like Shutterstock can help you generate passive income. On such platforms, you get paid for your images as they are bought by users.<\/p>\n\n\n\n<p id=\"2e90\">If you have a soft spot for photography and art, you can help yourself to some extra cash simply by uploading your quality photos online and getting paid for them based on how they are bought. Other platforms where you can sell your photos to include:<\/p>\n\n\n\n<ul><li>Getty Images<\/li><li>iStock Photo<\/li><li>Stocksy<\/li><li>Alamy<\/li><li>SmugMug Pro<\/li><li>500px<\/li><li>Etsy<\/li><\/ul>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"bde6\"><strong>Final Thoughts on Passive Income Ideas in Nigeria<\/strong><\/h1>\n\n\n\n<p id=\"a224\">You should not, for any reason, be tempted into believing that a passive income stream requires zero work. On the contrary, the time and money to be invested has to be put in early on.<\/p>\n\n\n\n<p id=\"7f95\">It only becomes a passive income source after you have done an amazing job setting it up to generate money. Here’s a reminder that every single passive income idea shared above is 100% legitimate and can make you as much as N500,000 if you put in the time and resources.<\/p>\n\n\n\n<p id=\"087c\">Other passive income ideas in Nigeria include transport investment, creating a membership-based website, authoring and selling books, selling courses online, blogging and Forex trading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the best things about passive income streams is that they allow you to &hellip; <a href=\"https:\/\/moneyinminutes.ng\/6-passive-income-ideas-in-nigeria\/\">Continued<\/a><\/p>\n","protected":false},"author":3,"featured_media":1156,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none"},"categories":[18],"tags":[19],"_links":{"self":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1154"}],"collection":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/comments?post=1154"}],"version-history":[{"count":1,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1154\/revisions"}],"predecessor-version":[{"id":1157,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1154\/revisions\/1157"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media\/1156"}],"wp:attachment":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media?parent=1154"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/categories?post=1154"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/tags?post=1154"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}