{"id":1163,"date":"2022-02-08T12:03:31","date_gmt":"2022-02-08T11:03:31","guid":{"rendered":"https:\/\/moneyinminutes.ng\/?p=1163"},"modified":"2022-02-08T13:42:52","modified_gmt":"2022-02-08T12:42:52","slug":"what-happens-if-you-keep-hiding-from-lenders-after-taking-a-loan","status":"publish","type":"post","link":"https:\/\/moneyinminutes.ng\/what-happens-if-you-keep-hiding-from-lenders-after-taking-a-loan\/","title":{"rendered":"What Happens If You Keep Hiding From Lenders After Taking a Loan?"},"content":{"rendered":"\n<p id=\"495e\">When it comes to repaying a loan or debt, there are generally three kinds of people. The first category are those who repay their loans in good time..<\/p>\n\n\n\n<p id=\"ccba\">The second category are those who are willing to pay but are held back by an emergency setback that prevents them from making their repayment as earlier agreed.<\/p>\n\n\n\n<p id=\"31d2\">Finally, we have those who deliberately avoid making the repayment in the hope that they can get away with it. Let’s take a quick look at the three categories before we proceed to elaborate on the third category.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>In line with the Central Bank of Nigeria’s (CBN)&nbsp;<a href=\"https:\/\/www.cbn.gov.ng\/Out\/2022\/FPRD\/Circular%20on%20Global%20Standing%20Instruction%20(GSI)%20for%20Individuals.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">latest operational guideline on loan recovery<\/a>, the amended operational guidelines of the Global Standing Instruction (GSI) triggers a continuous and unrestricted loan recovery by Deposit Money Banks (DMBs) and financial institutions in the country.<\/p><\/blockquote>\n\n\n\n<p id=\"53ca\"><strong>Source:<\/strong>&nbsp;<a href=\"https:\/\/www.cbn.gov.ng\/Out\/2022\/FPRD\/Circular%20on%20Global%20Standing%20Instruction%20(GSI)%20for%20Individuals.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">Central Bank of Nigeria<\/a><\/p>\n\n\n\n<p id=\"0521\">What this means is that if you have an unpaid loan in Nigeria or you get flagged as a serial debtor, there will come a time when the money in any financial institution or electronic wallet that you own will be debited to settle your outstanding loan(s). Let us proceed to take a look at the aforementioned categories of lenders.<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"e13c\"><strong>Those Who Repay Their Loan<\/strong><\/h2>\n\n\n\n<p id=\"458c\">If you belong to the first category, you enjoy all the benefits that come with making prompt repayments. It positions you as a responsible borrower, and helps you increase your borrowing capacity and credit reputation..<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"77e6\"><strong>Those Who Can’t Repay &amp; Contact the Lender<\/strong><\/h2>\n\n\n\n<p id=\"817b\">If you belong here, contacting the lender gives you several realistic options designed to help you build and maintain a healthy credit score whilst enjoying an increased borrowing capacity on subsequent loans.<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"fa5a\"><strong>Those Who Keep Hiding After Taking a Loan<\/strong><\/h2>\n\n\n\n<p id=\"9a40\">If you fall into this category, then you deliberately avoid the lender with the intention to avoid making a repayment. You might be under the delusion that you are smart but unknown to you, you are inadvertently harming your financial profile and reputation. Sadly, it doesn’t end there as your records will show that you cannot be trusted with money. Below are things that are likely to happen if you continue to avoid lenders after taking a loan.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/miro.medium.com\/max\/1400\/1*J52STLtj6597D5lGnM9eWA.jpeg\" alt=\"\"\/><\/figure>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"4f9c\"><strong>Debt Collectors Will Take Over<\/strong><\/h2>\n\n\n\n<p id=\"f795\">While professional lenders might be quite courteous when dealing with you, many debt collectors are a bit unorthodox in their approach and will come after you in a bid to recover the loan.<\/p>\n\n\n\n<p id=\"cbe9\">For debt collectors, the adage “you can run but you can’t hide” is quite applicable.<\/p>\n\n\n\n<p id=\"024b\">If you ignore their phone calls, they might make an attempt to contact you via social media platforms. If you are adamant enough to go as far as ignoring or blocking a debt collector on social media, you will eventually find yourself with a collections lawsuit filed against you in a court.<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"ef2a\"><strong>What If You Ignore the Lawsuit?<\/strong><\/h2>\n\n\n\n<p id=\"7553\">If the lawsuit is ignored, the court will likely enter a default judgment, which empowers the debt collector to garnish your wages.<\/p>\n\n\n\n<p id=\"5ad9\">Garnishment, or wage garnishment, is when money is legally withheld from your paycheck and sent to another party. It refers to a legal process that instructs a lender to deduct payments directly from a debtor’s bank account. Yet, that’s not all.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>The CBN recently explained that in effect, the GSI’s automated loan recovery feature, applicable to all loans in the industry, shall remain perpetually in place throughout the life of the loan and\/or until the loan is fully repaid.<\/p><\/blockquote>\n\n\n\n<p id=\"7226\"><strong>Source:<\/strong>&nbsp;<a href=\"https:\/\/tribuneonlineng.com\/cbn-amends-operational-guidelines-on-gsi-seeks-endless-loan-recoveries\/\" rel=\"noreferrer noopener\" target=\"_blank\">Tribune Newspaper<\/a><\/p>\n\n\n\n<p id=\"c1cd\">Imagine having your child’s school fees or your rent withdrawn from your account to settle a loan you had chosen to ignore? Your guess is as good as ours.<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"79ae\"><strong>Final Thoughts on Hiding and Ignoring Lenders After Taking a Loan<\/strong><\/h2>\n\n\n\n<p id=\"1fb3\">Regardless of the financial situation you find yourself in after taking a loan, you should never fall into the temptation of ‘ghosting’ the lender. It might initially seem like a smart move but the repercussions can be devastating to both your finances as well as your reputation. Depending on how bad things get, you risk getting blacklisted by virtually all financial institutions the moment you are reported to the credit bureau.<\/p>\n\n\n\n<p id=\"8071\">Remember, lenders are human and will always offer you a listening ear as long as you make a realistic proposition.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When it comes to repaying a loan or debt, there are generally three kinds of &hellip; <a href=\"https:\/\/moneyinminutes.ng\/what-happens-if-you-keep-hiding-from-lenders-after-taking-a-loan\/\">Continued<\/a><\/p>\n","protected":false},"author":3,"featured_media":1165,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none"},"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1163"}],"collection":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/comments?post=1163"}],"version-history":[{"count":2,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1163\/revisions"}],"predecessor-version":[{"id":1172,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1163\/revisions\/1172"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media\/1165"}],"wp:attachment":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media?parent=1163"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/categories?post=1163"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/tags?post=1163"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}