{"id":1167,"date":"2022-02-08T12:13:53","date_gmt":"2022-02-08T11:13:53","guid":{"rendered":"https:\/\/moneyinminutes.ng\/?p=1167"},"modified":"2022-02-08T12:13:55","modified_gmt":"2022-02-08T11:13:55","slug":"ways-to-protect-your-phone-from-hackers-intruders","status":"publish","type":"post","link":"https:\/\/moneyinminutes.ng\/ways-to-protect-your-phone-from-hackers-intruders\/","title":{"rendered":"Ways to Protect Your Phone From Hackers &#038; Intruders"},"content":{"rendered":"\n<p id=\"6743\">Once upon a time, the only devices that got hacked were those belonging to celebrities and prominent personalities. However, those days are long gone and smartphone hacking has become a legitimate concern for anyone who owns a mobile device; even you!<\/p>\n\n\n\n<p id=\"d18b\">The last thing you want is to suddenly receive debit notifications from your bank for unauthorized transactions. This could wreak unspeakable havoc on your finances. To keep you protected at all times, we spoke to cybersecurity experts as well as professionals within the financial sector and they shared a series of tips you would find truly helpful. We will begin with basic phone security tips for casual phone users<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"ce0f\"><strong>Never Leave Your Device Unattended<\/strong><\/h2>\n\n\n\n<p id=\"3940\">It is called a mobile device for a reason. This means you should strive to carry it with you at all times, especially whenever you are in a public place. This is a basic rule that you should never overlook.<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"4386\"><strong>Don’t Use Your Phone’s Default Passcode<\/strong><\/h2>\n\n\n\n<p id=\"3f44\">If you are still using your phone’s default passcode, it’s time to change it. Resist the urge to stick with the default passcode just because you find it convenient. Please note that changing it doesn’t mean you should change it to ‘1234,’ ‘0000,’ ‘2222’ or any other commonly used code. Switch it to something more complex and please don’t use your date of birth.<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"8fe5\"><strong>Be Wary of Bluetooth Security<\/strong><\/h2>\n\n\n\n<p id=\"7830\">Whenever you aren’t using the Bluetooth feature on your mobile device, please do well to turn it off. Unprotected Bluetooth networks should also be avoided as they make your device prone to getting hacked.<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"c8dd\"><strong>Prioritise the Protection of Your PIN and Card Data<\/strong><\/h2>\n\n\n\n<p id=\"29be\">The first rule with storing PINs and details of your debit\/credit cards is that you should never store them on your mobile device. However, if you must store them, use a protected app for this.<\/p>\n\n\n\n<h1 class=\"has-large-font-size\" id=\"10ec\"><strong>Advanced Ways to Protect Your Phone From Hacking<\/strong><\/h1>\n\n\n\n<p id=\"d02c\">If the basic security tips above don’t give you the level of security you crave, it might be time to take things a notch higher with these advanced tips that we have put together for you.<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"ec28\"><strong>Don’t Use Unsecured Public Wifi<\/strong><\/h2>\n\n\n\n<p id=\"44e5\">The allure of free Wifi might be hard to resist but for the safety of your phone and the sensitive information it contains, do well to walk away. This brings to mind the popular slang in Nigeria, which says, “awoof dey run belle.” Remember that the moment your account gets hacked, the first thing hackers usually go for is your bank account. Therefore, you should be proactive and do the needful.<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"39c8\"><strong>Don’t Use Your Autocomplete Feature<\/strong><\/h2>\n\n\n\n<p id=\"e673\">Leaving your autocomplete functionality turned on at all times makes it easier for hackers to find a path into your mobile device. By turning it off, you prevent sensitive data from unauthorized access.<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"89b6\"><strong>Enable ‘Find My Phone’<\/strong><\/h2>\n\n\n\n<p id=\"854f\">If you are an iPhone or Samsung user, you should turn on the “Find My Phone” feature. This would make it easier and faster to locate your phone if you ever misplace it before people with ulterior motives lay their hands on it.<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"6261\"><strong>Cultivate the Habit of Deleting Your Browsing History, Cookies &amp; Cache<\/strong><\/h2>\n\n\n\n<p id=\"c405\">Your browsing history, cookies and cache are your virtual digital footprints. In other words, they are the data that is left behind when you have been online. Basically, they show where you have deliberately shared information about yourself. Endeavour to routinely delete them on your mobile device<\/p>\n\n\n\n<h2 class=\"has-large-font-size\" id=\"4d0a\"><strong>Final Thoughts on Securing Your Phone From Hackers<\/strong><\/h2>\n\n\n\n<p id=\"d280\">Avoid clicking suspicious links on your mobile device. The Nigerian Communications Commission (NCC)&nbsp;<a href=\"https:\/\/dailypost.ng\/2022\/01\/29\/ncc-warns-nigerians-on-new-ways-hackers-attack-phones-through-sms-power-outage-messages\/\" rel=\"noreferrer noopener\" target=\"_blank\">recently warned Nigerians<\/a>&nbsp;to be wary of TangleBot, a new virus infecting Android mobile devices through short messaging service (SMS).<\/p>\n\n\n\n<p id=\"5e91\">The commission explained that the goal of hackers is to encourage potential victims to follow a link that supposedly offers detailed information. “The immediate consequence to this, is that the malware then steals sensitive data stored on the device and monitors almost every user activity, including camera use, audio conversations, and location, among other things.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Once upon a time, the only devices that got hacked were those belonging to celebrities &hellip; <a href=\"https:\/\/moneyinminutes.ng\/ways-to-protect-your-phone-from-hackers-intruders\/\">Continued<\/a><\/p>\n","protected":false},"author":3,"featured_media":1169,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none"},"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1167"}],"collection":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/comments?post=1167"}],"version-history":[{"count":1,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1167\/revisions"}],"predecessor-version":[{"id":1170,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1167\/revisions\/1170"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media\/1169"}],"wp:attachment":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media?parent=1167"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/categories?post=1167"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/tags?post=1167"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}