{"id":1173,"date":"2022-04-06T10:56:55","date_gmt":"2022-04-06T09:56:55","guid":{"rendered":"https:\/\/moneyinminutes.ng\/?p=1173"},"modified":"2022-04-06T13:59:02","modified_gmt":"2022-04-06T12:59:02","slug":"money-in-minutes-our-journey-so-far","status":"publish","type":"post","link":"https:\/\/moneyinminutes.ng\/money-in-minutes-our-journey-so-far\/","title":{"rendered":"Money in Minutes: Our Journey So Far"},"content":{"rendered":"\n<p>It all started with a goal to help Nigerians achieve three things &#8211; overcoming poverty, access to sustainable energy and giving hardworking Nigerians an opportunity to afford their own homes. We chose not to rush into this. Rather, we approached this as an exquisite piece of architecture.<\/p>\n\n\n\n<p>We decided to tackle poverty by providing Nigerians easy access to money to meet their needs. This, for us, was the first brick.&nbsp;<\/p>\n\n\n\n<p>With a reputation in the UK and a presence spanning three continents, this was a project we were extremely keen on.<\/p>\n\n\n\n<p>Twelve months down the line, we have partnered with employers to provide on-demand and flexible salary access to their employees to improve their financial strength and productivity, and we have opened our doors to Nigerians via quick and affordable loans as well as supporting individuals and businesses but that&#8217;s not all&#8230;<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>The Underrated Stance of Affordable Finance<\/strong><\/p>\n\n\n\n<p>Having access to finance and having access to affordable finance are two different things as made manifest from the feedback we received from Nigerians. We realised that a growing number of Nigerians don&#8217;t have access to affordable finance in the real sense of it.<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>The Hustle of Hardworking Nigerians<\/strong><\/p>\n\n\n\n<p>The average Nigerian spends about 56.5% of their income on food in a year, which explains why salaries are exhausted before the next paycheck arrives. The reality of this is that 31.7% of youths, men and women employed or self-employed, still lack access to bank loans to meet their needs due to high interest rates as revealed by the National Bureau of Statistics and this is where we come in.<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>The Beta Phase<\/strong><\/p>\n\n\n\n<p>We kicked off partnering with employers to provide on-demand salary access through WageX and providing personal loans based on the data that was available to us at the time. However, in line with our goals, we discovered that there was a need to make improvements to the experience and impact we deliver in order to move from where we were to where we really wanted to be.<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>Bigger &amp; Better! Money to Do More&#8230;<\/strong><\/p>\n\n\n\n<p>Our new Money in Minutes platform has been improved and optimised for a new feel and our brand re-introduced with a new brand identity and logo refresh.<\/p>\n\n\n\n<p>To help people grow their access to cash whether they have a bad credit score or not, they now have the opportunity to build their credit score and credit limit from small loan amounts in a very short period through our newly launched KYC light &#8211; the Credit Builder ₦5,000 Loan where we take a risk on them to help them grow, and shield them from predatory lenders while expanding access to affordable loans up to ₦5,000,000 for individuals and businesses.<\/p>\n\n\n\n<p>Scaling on-demand salary access with employers &amp; businesses free of cost or challenges through our HR tech employee benefit solution WageX, to improve employee productivity and business performance for their organisations coupled with financial education, working with strategic partners like Interswitch and Remita to widen and ensure that we support far more employees and organisations.<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>Exciting Days Ahead<\/strong><\/p>\n\n\n\n<p>We have onboarded several Nigerian businesses and we have come to understand how much they value their business performance. We are more interested in being the catalyst to help Nigerians do more. Yet, we are still scratching the surface as there is so much more to come.<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>The Next Step?<\/strong><\/p>\n\n\n\n<p>The journey has just begun as we continue to deliver faster and more convenient access to affordable finance to our users as well as personalised solutions to employees and businesses. Behind all the hard work we have put into this is our dedicated team who ensure that our wheels of progress continue to spin.&nbsp;<\/p>\n\n\n\n<p>Special thanks to you for walking with us and forging ahead on this promising journey of limitless possibilities.<\/p>\n\n\n\n<p>We’ve only just begun.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It all started with a goal to help Nigerians achieve three things &#8211; overcoming poverty, &hellip; <a href=\"https:\/\/moneyinminutes.ng\/money-in-minutes-our-journey-so-far\/\">Continued<\/a><\/p>\n","protected":false},"author":3,"featured_media":1197,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none"},"categories":[22,18],"tags":[26,15,19,25],"_links":{"self":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1173"}],"collection":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/comments?post=1173"}],"version-history":[{"count":3,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1173\/revisions"}],"predecessor-version":[{"id":1198,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/1173\/revisions\/1198"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media\/1197"}],"wp:attachment":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media?parent=1173"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/categories?post=1173"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/tags?post=1173"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}