{"id":987,"date":"2021-09-01T16:23:55","date_gmt":"2021-09-01T15:23:55","guid":{"rendered":"https:\/\/moneyinminutes.ng\/?p=987"},"modified":"2021-09-09T10:43:49","modified_gmt":"2021-09-09T09:43:49","slug":"free-credit-score","status":"publish","type":"post","link":"https:\/\/moneyinminutes.ng\/free-credit-score\/","title":{"rendered":"How to Get a Free Credit Score Check in Nigeria"},"content":{"rendered":"\n<p>Do you know how to go about checking your credit score in Nigeria? If you can&#8217;t, we&#8217;re here to help you change that narrative and that’s because knowing your credit score is really important. However, before we delve into how to check your credit score without spending a dime, let us take a quick look at what a credit score is as well as other things you should know.<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>What is a Credit Score?<\/strong><\/p>\n\n\n\n<p>For clarity, a credit score is a number between 300–850 that depicts your creditworthiness as an individual. The higher your score, the better you look to potential lenders as a borrower.<\/p>\n\n\n\n<p>Any financial organisation looking to lend you quick cash will always use your credit score to evaluate the probability that you will repay loans within the agreed repayment period.<\/p>\n\n\n\n<p>We should mention here that your credit score is heavily dependent on the information on your credit report, which is actually your credit history over a period.<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>How Does the Credit Score Work?<\/strong><\/p>\n\n\n\n<p>The lower your credit score, the lower it is for the riskier it is for lenders to trust you with their money. As mentioned earlier, your credit score is a 3-digit number. The lowest number you can possibly have is 300 while the highest you can have is 850.<\/p>\n\n\n\n<p>Below is the standard measuring range for credit scores:<\/p>\n\n\n\n<ul><li>300 &#8211; 599 = Very Bad<\/li><li>600 &#8211; 649 = Poor<\/li><li>650 &#8211; 699 = Fair<\/li><li>700 &#8211; 749 = Good<\/li><li>750 &#8211; 799 = Very Good<\/li><li>800 &#8211; above = Excellent<\/li><\/ul>\n\n\n\n<p style=\"font-size:30px\"><strong>How is Credit Score Calculated?<\/strong><\/p>\n\n\n\n<p>There are several factors that affect your eventual credit score as you will see below:<\/p>\n\n\n\n<ul><li><strong>Length of Your Credit History:<\/strong> With a short credit history, you can get yourself a good credit score. However, for this to happen, the rest of the report must show that you are responsible with credit. However, an extended credit history increases your credit score and the rate for this is over 15%.<\/li><li><strong>The Amount Owed:<\/strong> This factor focuses more on the amount owed in your account, the number of accounts with balance as well as the available credit. The rate for this is pegged at over 30%<\/li><li><strong>Payment History:<\/strong> Here, the emphasis is on your level of compliance with agreed payment terms. This should ideally be 35%. However, factors such as late payment, bankruptcy and default in payment have a huge impact on the outcome.<\/li><li><strong>Pursuing New Credit:<\/strong> Opening a new credit account will impact the rest of your credit history. The rate for this is over 10%<\/li><li><strong>Credit Mix:<\/strong> Things like your personal lines of credit, instalment loans and credit cards can increase your credit score slightly. The rate for this stands at over 10%.<\/li><\/ul>\n\n\n\n<p style=\"font-size:30px\"><strong>How to Check Your Credit Score<\/strong><\/p>\n\n\n\n<p>If you have ever considered applying for a loan in Nigerian, then you probably know that your credit score is what lenders rely on to determine how safe or risky you come across as a potential customer.<\/p>\n\n\n\n<p>Your credit score is dependent on your account activity.&nbsp;<\/p>\n\n\n\n<p>Interestingly, to check your credit score in Nigeria, the first thing you need to do is to access your credit report. This is because your ratings are dependent on the information contained in your credit reports.<\/p>\n\n\n\n<p>A credit report comes with details about your past and existing credit agreements. For instance, this will include loans, credit, debt collections, mortgages and whether you’ve made on-time payments for your bills as well as the lists of businesses that have most recently viewed your credit history.&nbsp;<\/p>\n\n\n\n<p>Below are ways through which you can access your credit report and by extension, your credit score:<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>Apply on the CRC Credit Bureau Website<\/strong><\/p>\n\n\n\n<p>You can apply for a Credit Report from any Credit Bureau registered in Nigeria but you should bear in mind that this comes at a cost of NGN5,000<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>Get it For Free on Money in Minutes<\/strong><\/p>\n\n\n\n<p>The moment you apply for a loan at Money in Minutes, you get free access to your credit score but that&#8217;s not all. In addition to getting your credit score for free, Money in Minutes also helps you build your credit score towards having an excellent score.<\/p>\n\n\n\n<p>Remember that a good credit score means that you enjoy easy access to lower interests on your quick loans. This, in turn, unlocks more money for you to access through finance.<\/p>\n\n\n\n<p style=\"font-size:30px\"><strong>Final Thoughts on Getting a Free Credit Score Check in Nigeria<\/strong><\/p>\n\n\n\n<p>Now that you know how to get to check your credit score free of charge in Nigeria, you can proceed to install the Money in Minutes app to get a <a href=\"https:\/\/myaccount.moneyinminutes.ng\/Account\/Register\"><strong>free Credit Score check<\/strong><\/a> in Nigeria<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Do you know how to go about checking your credit score in Nigeria? If you &hellip; <a href=\"https:\/\/moneyinminutes.ng\/free-credit-score\/\">Continued<\/a><\/p>\n","protected":false},"author":3,"featured_media":991,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none"},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/987"}],"collection":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/comments?post=987"}],"version-history":[{"count":6,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/987\/revisions"}],"predecessor-version":[{"id":1000,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/posts\/987\/revisions\/1000"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media\/991"}],"wp:attachment":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media?parent=987"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/categories?post=987"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/tags?post=987"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}