{"id":87,"date":"2020-06-04T03:55:30","date_gmt":"2020-06-04T03:55:30","guid":{"rendered":"http:\/\/localhost\/zz\/mim\/?page_id=87"},"modified":"2021-11-18T16:36:31","modified_gmt":"2021-11-18T15:36:31","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/moneyinminutes.ng\/privacy-policy\/","title":{"rendered":"Privacy and Cookie Policy"},"content":{"rendered":"\n<p>MIM Finance Company Limited respects your privacy and is committed to protecting your Personally Identifiable Information (PII) that may be collected through your use of our website or mobile application (together, Site) or in applying for or receiving any of our products or services (Services). This privacy policy (Policy) describes how we collect and use your PII and how you can control that use.<\/p>\n\n\n\n<p>Please read this Policy carefully.<\/p>\n\n\n\n<p>By Clicking the continue or Accept icon or any other icon that indicated agreement with this Privacy Policy, downloading the MIM App and applying for any of our services including but not limited to the Loan Application, you agree to our collection, use, and sharing of your PII as described in this Policy.<\/p>\n\n\n\n<p><br>1<strong>. Application and Principles<\/strong><\/p>\n\n\n\n<p>1.1&nbsp;This privacy policy (Policy) describes how we collect and use your PII and how you can control that use. Please read this Policy carefully.<\/p>\n\n\n\n<p>1.2&nbsp;By Clicking the continue or Accept icon or any other icon that indicated agreement with this Privacy Policy, downloading the MIM App and applying for any of our services including but not limited to the Loan Application, you agree to our collection, use, and sharing of your PII as described in this Policy;<\/p>\n\n\n\n<p>1.3&nbsp;This Policy shall apply to visitors to the MIM Websites and the Privacy Policy together with the Terms and Conditions of the Loan Account Agreement shall jointly apply to the use of:<\/p>\n\n\n\n<p>a. Any User of the content of the MIM website;<\/p>\n\n\n\n<p>b. The MIM Mobile Application Software available for download and\/or streaming from the MIM Website, Google Play Store or any other platform\/ third party sites where the App is hosted; and<\/p>\n\n\n\n<p>c. Applying or subscribing to any of the Services offered by MIM including but not limited to application for loan.<\/p>\n\n\n\n<p>1.4&nbsp;The underlisted principles guide how MIM processes your personal data:<\/p>\n\n\n\n<p>a) Purpose: collected only for specified, explicit and legitimate purposes and not further processed in a manner incompatible with those purposes.<\/p>\n\n\n\n<p>b) Law and Fairness: processed lawfully, fairly, in a transparent manner and with respect for the dignity of the human person.<\/p>\n\n\n\n<p>c) Need: adequate, relevant and limited to what is necessary in relation to the purposes for which it is processed.<\/p>\n\n\n\n<p>d) Timeliness: accurate and where necessary kept up to date.<\/p>\n\n\n\n<p>e) Duration: not kept in a form which permits identification of data subjects for longer than is necessary for the purposes for which the personal data is processed.<\/p>\n\n\n\n<p>f) Security: processed in a manner that ensures its security, using appropriate technical and organisational measures to protect against unauthorised or unlawful processing and against accidental loss, destruction or damage.<\/p>\n\n\n\n<p>1.5&nbsp;You confirm that you agree and consent to this Privacy Policy together with the Terms and Conditions by downloading the App, or use of any of the MIM Services and you also consent to the collection, use and storage of your information in the manner provided herein.<\/p>\n\n\n\n<p><strong>2. Purpose of Collecting your Personal Identifiable Information (PII)<\/strong><\/p>\n\n\n\n<p>2.1&nbsp;MIM shall require your Personal Identifiable Information (PII) for the purpose of you downloading the App and your opening of an account with MIM;<\/p>\n\n\n\n<p>2.2&nbsp;MIM shall require your PII to comply with the Know Your Customer (KYC) requirements of the Central Bank of Nigeria (CBN) and other regulatory provisions to which MIM is bound;<\/p>\n\n\n\n<p>2.3&nbsp;MIM shall also require information to ascertain your satisfaction of its service criteria for prospective clients including but not limited to age, occupation and determine your creditworthiness.<\/p>\n\n\n\n<p>2.4&nbsp;You may withdraw your consent from this privacy policy, however, all accrued obligations prior such withdrawal shall remain subsisting and valid until such obligations are fulfilled.<\/p>\n\n\n\n<p><strong>3. Required Information<\/strong><\/p>\n\n\n\n<p>3.1 Submitted information:<\/p>\n\n\n\n<p>a. Information we may collect and process from you include those you provide to us whilst filling in forms in the App or on our Site(s), provided by corresponding with us; provided by registering to use our Site, downloading or registering the App, subscribing to any of our Services (such as applying for a loan), searching for an app or Service, sharing data via the App&#8217;s social media functions, entering a competition, promotion or survey, and reporting a problem with the App, our Services, our App Site or any of Our Service Sites.<\/p>\n\n\n\n<p>b. This information may include your name, address, email address and phone number, the Device&#8217;s phone number, SIM card details, age, username, password and other registration information, financial and credit information (including your mobile money account details, bank account details, and bank verification number, where applicable), personal description and photograph.<\/p>\n\n\n\n<p><strong>3.2 Collected Information:<\/strong><\/p>\n\n\n\n<p>a. Information we may collect from you automatically include information including but not limited to your, technical information, including the type of mobile device you use, unique device identifiers (for example, your Device&#8217;s IMEI or serial number), information about the SIM card used by the Device, mobile network information, your Devices operating system, browser information and details, or your Devices location and time zone setting (Device Information); information stored on your Device, including contact lists, call logs, SMS logs, photos, videos or other digital content (Content Information); data from your use of any other third-party application on the Device or the Service Sites; and details of your use of any of our Apps or your visits to any of Our Service Sites; including, but not limited to, traffic data, location data, weblogs and other communication data (Log Information).<\/p>\n\n\n\n<p><br>4. Location and Movement information.<\/p>\n\n\n\n<p>a. By Downloading and Using any of our services, you consent to our automatic collection of data relating to your location via GPS Technology or other location services.<\/p>\n\n\n\n<p>b. You can withdraw your consent to our collection, processing or use of this information at any time by logging out and uninstalling the App from your Device.<\/p>\n\n\n\n<p><strong>5. Unique Application Numbers.<\/strong><\/p>\n\n\n\n<p>We may receive information on the type of operating system, Unique Application number and installation information when you install or uninstall a Service containing a unique application number or when such a Service searches for automatic updates<\/p>\n\n\n\n<p><strong>6. Cookies and Other Tracking Technologies<\/strong><\/p>\n\n\n\n<p>6.1&nbsp;We may use mobile tracking technologies and\/or website cookies to distinguish you from other users of the App, App Site, or Service Sites.<\/p>\n\n\n\n<p>6.2&nbsp;To Provide you with a good experience when you visit the Website or use the App or browse any of the sites and also allows us to improve the App and Our Sites, we make use of cookies<\/p>\n\n\n\n<p>6.3&nbsp;Statistical or aggregated information does not directly identify a specific person, but it may be derived from your PII. For example, we may aggregate PII to calculate the percentage of users in a particular area.<\/p>\n\n\n\n<p><strong>7. Processing your Information<\/strong><\/p>\n\n\n\n<p>7.1&nbsp;In accordance with this Policy, we may associate any category of information with any other category of information and will treat the combined information as personal data for as long as it is combined.<\/p>\n\n\n\n<p>7.2&nbsp;Information collected by us shall be used to determine the prospective customers credit worthiness and for the purpose of determining whether or not to provide a loan application to the customer, the amount of such loan and the terms and conditions applicable to such loan.<\/p>\n\n\n\n<p>7.3&nbsp;Save in compliance with an order of the Court, Arbitral Panel, Tribunal, Regulatory Directive or Order or any other legal or regulatory obligation, we do not disclose information about identifiable individuals to other parties, but we may provide them with anonymous aggregate information about our users.<\/p>\n\n\n\n<p><strong>8. Third Party Access to your Information<\/strong><\/p>\n\n\n\n<p>8.1&nbsp;To ensure efficient delivery of our services to you we may receive information from other sources and may be required to work with a number of third parties (including credit reference agencies and mobile network providers) and we may receive information about you from them.<\/p>\n\n\n\n<p>8.2&nbsp;MIM shall secure the confidentiality of your data and PII to avoid unauthorized without prejudice to our right to share information, including PII, with third parties, as described below:<\/p>\n\n\n\n<p>a. Service Providers: We may share information with service providers that help us perform functions and process your transactions.<\/p>\n\n\n\n<p>b. Affiliates: We may share information with a parent company, subsidiaries, joint ventures, or other companies under common control with us who shall also comply with the terms of this Privacy Policy. We provide such information to other trusted businesses or persons for the purpose of processing personal information on our behalf. We require that these parties agree to process such information based on our instructions and in compliance with this Privacy Policy and any other appropriate confidentiality and security measures.<\/p>\n\n\n\n<p>c. Other Companies: We may share information with other companies for purposes of marketing our products to you or for analysing our business and transactions.<\/p>\n\n\n\n<p>d. Corporate Structure: We may share information in connection with a merger, acquisition, consolidation, change of control, or sale of all or a portion of our assets or if we undergo bankruptcy or liquidation.<\/p>\n\n\n\n<p>e. To Prevent Harm: We may share information if we believe it is necessary in order to detect, investigate, prevent, or take action against illegal activities, fraud, or situations involving potential threats to the rights, property, or personal safety of any person.<\/p>\n\n\n\n<div style=\"height:36px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<hr class=\"wp-block-separator has-text-color has-background has-cyan-bluish-gray-background-color has-cyan-bluish-gray-color\"\/>\n\n\n\n<div style=\"height:36px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p class=\"has-huge-font-size\"><strong>Cookies Policy<\/strong><\/p>\n\n\n\n<p>A cookie is a small text file that is stored on a user’s computer. It can contain information about the user and the way they interact with the internet and can help make a user’s online experience more efficient. We use encrypted information gathered from them to help improve your experience of the site. For example, they help us to identify and resolve errors, or to determine relevant information to show you when you’re browsing.<\/p>\n\n\n\n<p><br>We’re giving you this information as part of our initiative to comply with recent legislation, and to make sure we’re honest and clear about your privacy when using our website. We know you’d expect nothing less from us, and please be assured that we’re working on a number of other privacy and cookie-related improvements to the website. We use cookies to improve your experience on our websites and to review how and when our sites are used. We use a number of cookies to do this:<\/p>\n\n\n\n<ul><li>Session cookies: These are cookies that are necessary for the operation of the site. However, these cookies are temporary, so they will be removed from your computer as soon as you close your browser.<\/li><li>These are cookies that remain on your computer even after you close our website and your browser. These types of cookies allow our website to remember details about you if you visit again, like how you previously used the site.<\/li><li>Analytical cookies: These are cookies that help us understand and analyze the use of our website. They record things like the number of times you visit, how long you stay on the site and how you reached our site. These cookies only track your use of our site and do not track your use of other sites on the internet.<\/li><\/ul>\n\n\n\n<p>You can decline the use of non-essential cookies or change your browser settings to block some or all cookies. Please note that we’re not responsible for the content of external websites. <\/p>\n\n\n\n<p>If you choose to block all cookies, our site will not function as intended and you will not be able to use or access many of the services we provide. If you have blocked all cookies and wish to make full use of the features and services we offer, you will need to enable your cookies.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>MIM Finance Company Limited respects your privacy and is committed to protecting your Personally Identifiable &hellip; <a href=\"https:\/\/moneyinminutes.ng\/privacy-policy\/\">Continued<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_seopress_robots_primary_cat":""},"_links":{"self":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/pages\/87"}],"collection":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/comments?post=87"}],"version-history":[{"count":15,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/pages\/87\/revisions"}],"predecessor-version":[{"id":1072,"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/pages\/87\/revisions\/1072"}],"wp:attachment":[{"href":"https:\/\/moneyinminutes.ng\/wp-json\/wp\/v2\/media?parent=87"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}